pymmclient/test/data/seal_in.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:ns3="http://minameddelanden.gov.se/schema/Message" xmlns:ns0="http://minameddelanden.gov.se/schema/Sender" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns4="http://minameddelanden.gov.se/Service" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><ns1:Body><ns4:deliverSecure><arg0><ns3:SignedDelivery><ns3:Delivery><ns3:Header><ns3:Sender><ns0:Id>162021003898</ns0:Id><ns0:Name>Kommun B</ns0:Name></ns3:Sender><ns3:Recipient>192705178354</ns3:Recipient></ns3:Header><ns3:Message><ns3:Header><ns3:Id>f614c385-203c-11e3-b2eb-542696cf5deb</ns3:Id><ns3:Subject>Test-dela-ut</ns3:Subject><ns3:Supportinfo><ns3:Text>Vand er till X om ni har fragor angaende detta meddelande</ns3:Text><ns3:URL>http://www.kommun_b.se</ns3:URL><ns3:PhoneNumber>08-12121212</ns3:PhoneNumber><ns3:EmailAdress>info@kommun_b.se</ns3:EmailAdress></ns3:Supportinfo><ns3:Language>svSE</ns3:Language><ns3:Reply>NOT_ALLOWED</ns3:Reply><ns3:ReceiptRequest>NOT</ns3:ReceiptRequest></ns3:Header><ns3:Body><ns3:ContentType>text/plain</ns3:ContentType><ns3:Body>RXR0IGxpdGV0IHPDpGtlcnQgbWVkZGVsYW5kZSBmcsOlbiBNaW5hTWVkZGVsYW5kZW4h</ns3:Body></ns3:Body></ns3:Message></ns3:Delivery><ns3:Signature><ns2:SignedInfo><ns2:CanonicalizationMethod/><ns2:SignatureMethod/></ns2:SignedInfo><ns2:SignatureValue/></ns3:Signature></ns3:SignedDelivery><ns3:Seal><ns3:ReceivedTime>2013-11-14+01:00</ns3:ReceivedTime><ns3:SignaturesOK>true</ns3:SignaturesOK></ns3:Seal></arg0></ns4:deliverSecure></ns1:Body></SOAP-ENV:Envelope>
